"""
Домашнее задание по for
"""

# задание 1

"""
Создайте список из 5 разных крипто активностей.
Программа создает список 100 кошельков с адресами в формате "0x" + 40 случайных символов из набора "abcdef0123456789".
Программа создает список балансов кошельков, которые изначально равны 0.
Программа создает список количества транзакций кошельков, которые изначально равны 0.

Программа должна сделать ровно 10 рандомных транзакций из списка активностей на каждом кошельке, по одной транзакции за 1 раз. Активности могут повторяться.
Кошельки могут отрабатываться по порядку, без рандомизации.
Если баланс кошелька нулевой программа должна выводить с биржи от 1 до 3 токенов и прибавлять к балансу.
Стоимость одной транзакции - активности = от 1 до 2 токенов (рандомно). Если денег на транзакцию не хватает,
программа должна выводить не хватающую сумму и прибавлять к балансу перед осуществлением транзакции.
Нужно печатать информацию о каждой транзакции и минусовать из баланса стоимость транзакции.

"""

# задание 2

"""
Реализуйте программу ниже с помощью 3 строчек кода используя однострочное создание списков.

Сгенерируйте список из 100 паролей длиной 8 символов, состоящих из цифр и маленьких букв - одной строкой кода. (подсказка: используйте random.choices)
Сгенерируйте второй список с теми же паролями, только буквы большие. (используйте исходный список паролей за основу) - одной строкой кода
Сгенерируйте третий список в котором будут лежать пароли из 2 списка в верхнем регистре у которых есть буква "D" - одной строкой кода.
"""





