"""
Домашнее задание по les_29_library_package_module
"""

# задание 1

"""
Создайте пакет functions, внутри которого создайте модуль withdraw.py.
В модуле withdraw.py создайте функции выводов с разных бирж.
Создайте скрипт main.py, который импортирует функции из модуля withdraw.py и вызывает их.
"""


# задание 2

"""
Импортируйте функции из модуля withdraw.py в файл main.py используя конструкцию as для сокращения имени функции и попробуйте вызывать по сокращенному имени.
"""

# задание 3

"""
Найдите и установите библиотеку web3.
Создайте файл requirements.txt в котором будут прописаны все библиотеки и версии, которые вы установили.
"""


