

# задание 1
"""
Напишите программу, которая генерирует случайное целое число между двумя введенными числами
и выводит сообщение о выводе токенов с биржи на кошелек
с указанной суммой
"""

# задание 2
"""
Доработайте код так, чтобы при сложении переменной number и числа 10 получалось 25, при этом
использовать математические операции с числами запрещено, только встроенные функции
"""

number = -15
# доработайте код тут
print(number + 10)  # должно вывести 25

# задание 3
"""
Написать программу которая запрашивает число у пользователя через функцию input()
и выводит сообщение о том, является ли число четным или нечетным - True или False
"""

# задание 4
"""
Создайте 3 переменные с характеристиками кошелька: баланс, количество транзакций, объем транзакций.
Создайте 4 переменные с минимальными критерием дропа: объем, количество транзакций, средняя сумма транзакции
и баланс и подставьте желаемые значения.
Обратите внимание что значение средней суммы транзакции у кошелька нужно высчитывать
на основе других переменных кошелька.
Чтобы быть Eligible нужно чтобы все значения были больше минимальных критериев.
Напишите программу, которая проверяет Eligible и выводит True или False, 
"""



