""""""

""" 
1. Настроить конфиг с переменной SecretStr для хранения ключа
2. Создать ключ шифрования в Fernet и сохранить в связку ключей вашей операционной системы
3. Создать функцию шифрования данных
4. Создать функцию дешифрования данных
5. Интегрировать функции шифрования в класс Metamask в методы create_wallet и import_wallet
6. Интегрировать функции дешифрования в класс Metamask в методы import_wallet и auth_metamask
Создать скрипт который создаст 10 кошельков в Metamask, сохранить зашифрованные пароли и сид фразы в excel файл.
После чего по очереди откроет 10 профилей с этими кошельками и авторизуется в них используя зашифрованные пароли.


"""

