""""""
"""
Задание 1
Создать функцию okx_withdraw_eth_arbitrum() которая будет делать вывод ETH на сеть Arbitrum one
c биржи OKX.
Функция на вход должна принимать адрес кошелька и сумму вывода. И печатать результат вывода.
Делайте указание комиссии прямо в коде вручную.
"""

"""
Задание 2
Создать функцию okx_withdraw_eth_optimism() которая будет делать вывод ETH на сеть optimism
c биржи OKX.
Функция на вход должна принимать адрес кошелька и сумму вывода. И печатать результат вывода.
Делайте указание комиссии прямо в коде вручную.
"""

"""
Задание 3
Создать функцию binance_withdraw_eth_arbitrum() которая будет делать вывод ETH на сеть Arbitrum one
c биржи Binance.
Функция на вход должна принимать адрес кошелька и сумму вывода. И печатать результат вывода.
Делайте указание комиссии прямо в коде вручную.
"""


