

"""Задачи"""

"""
Задача 1
Написать программу, которая при запуске спрашивает, в какой сети нужно считать баланс.
Программа должна считать из файла wallets.txt список кошельков,
запросить балансы всех кошельков в выбранной сети и записать результат в файл под названием выбранная_сеть.txt
список кошельков и их балансов: адрес - баланс
В процессе работы программа должна выводить информацию в терминале:
1. Номер проверяемого кошелька в списке
2. Адрес кошелька
3. Баланс в читаемом виде с указанием названия токена (ETH, BNB и т.д.)

пример: 
0. 0xac8ce8fbC80115a22a9a69e42f50713AAe9ef2F7 1.0 ETH

В конце работы программы в терминале должно вывестись сообщение:
Кошельков проверенно: 5
Суммарный баланс: 5.0 ETH (или другой токен)

"""
