"""
Домашнее задание по list
"""

# задание 1

"""
Вы вводите в терминале любой текст через пробел, программа должна напечатать список в котором все слова в обратном порядке, 
отдельное слово в отдельном элементе списка.
"""

# задание 2
"""
Возьмите предыдущее задание 3 из урока по while где нужно было раздать дроп рандомным кошелькам и доработайте программу таким образом чтобы кошельки, которые получают
дроп собирались в список и в конце печатался список кошельков получивших дроп, а не строчка.
"""

# задание 3

"""
Создайте при помощи цикла while список в котором будут перечислены четные числа от 1 до 100 включительно. (пример: [2, 4, 6, 8, 10, ...])
В во втором цикле while замените все числа на эти же числа в квадрате.
"""

# задание 4
"""
Создайте генератор списков паролей, который будет запрашивать диапазон длины пароля (от скольки до скольки символов), какие символы должны входить в пароль, 
а так же количество паролей.
На выходе должен получаться список с необходимым количеством паролей и в соответствии с запросом пользователя.
"""

# задание 5

"""
Создайте программу которая генерирует рандомный газ, при этом газ с вероятностью 50% должен увеличиваться или уменьшаться на 1 единицу раз в секунду.
Программа должна замерять газ за минуту и выводить его в виде списка, а так же печатать среднее значение газа за последнюю минуту.
"""

# задание 6
"""
Создайте список из 10 разных активностей. Программа должна спрашивать сколько транзакций нужно выполнить.
Создайте программу которая будет рандомно выбирать одну из активностей и выполнять ее (печатать в консоль), после рандомной паузы повторяет 
пока не сделает запрошенное количество транзакций.

HARD LEVEL: 
доработай программу так чтобы она печатала сколько раз была выполнена каждая активность.
"""
