""""""
"""
Задание 1
Создать функцию get_okx_fee(), которая возвращает комиссию вывода как в уроке.
"""

"""
Задание 2
Создать функцию okx_withdraw(), которая принимает на вход подключение к бирже, адрес кошелька, название токена, название сети и сумму.
Функция должна при помощи функции get_okx_fee() получать комиссии, и делать вывод на разные токены в разных сетях.
"""

"""
Задание 3
Сделать функцию get_binance_fee(), которая возвращает комиссию вывода с биржи binance.
"""

"""
Задание 4
Сделать функцию binance_withdraw(), которая принимает на вход подключение к бирже, адрес кошелька, название токена, название сети и сумму.
Функция должна при помощи get_binance_fee() получать комиссии и делать вывод суммы токенов за вычетом комиссии.
"""

"""
Задание 5
Заполните класс NetworksName данными для топ 3 используемых вами бирж, перечислите там название топ 10 используемых вами сетей для каждой биржи.
"""

