

# задание 1
"""
При проверке баланса кошелька в debank нужно перейти по url
https://debank.com/profile/0xac8ce8fbc80115a22a9a69e42f50713aae9ef2f7
где 0xac8ce8fbc80115a22a9a69e42f50713aae9ef2f7 - адрес вашего кошелька.
Напишите программу, которая спрашивает ввод адреса кошелька
в терминал и выводит в терминале url, сделайте без использования f строк (без f"")
P.S. с f строками делать удобнее, но мы тренируем конкатенацию
"""

# задание 2
"""
Напишите программу, которая генерирует простой пароль состоящий из 4 символов,
в пароле должны быть:
- маленькая латинская буква
- большая латинская буква
- цифра
- спец символ (например !@#$%^&*)
при каждом запуске программы пароль должен быть разным, 
для работы используйте только те инструменты,
которые мы обсуждали  в уроках (индексация строк, конкатенация, 
генератор случайного числа и т.д.).
Попробуйте сделать 2 разные реализации программы
"""

# задание 3
"""
Напишите программу, которая проверяет длину пароля введенную пользователем.
При запуске программы пользователь должен ввести пароль в терминал,
если длина пароля меньше 8 символов, программа должна вывести в терминал
сообщение с текстом False, если длина пароля больше или равна 8 символам,
программа должна вывести в терминал сообщение с текстом True
"""

# задание 4
"""
Напишите программу, которая запрашивает в терминале 
Фамилию, Имя и возраст в одну строчку, например ("  Макс Зарев 31 ")
программа должна удалять пустые символы до и после введенных данных, если пользователь ввел лишние пробелы,
и выводит в терминале сообщение, где имя должно быть написано 3 раза, фамилия 4 раза,
а возраст на 10 лет старше введенного, например (Макс Макс Макс Зарев Зарев Зарев Зарев 41)
"""

# задание 5
"""
Нарисовать в терминале елочку используя умножение строк
     * 
    ***
   *****
  *******
 *********
***********
     *
    ***
"""


# задание 5
"""
Создайте программу которая запрашивает в терминале текст и после печатает его
в терминале в обратном порядке (например вводим "привет", программа печатает "тевирп")
реализуйте используя только индексацию строк и срезы (нужно будет погуглить)
"""


# задание 6
"""
Создайте программу в которой должен быть записан пароль в переменную,
программа при запуске должна спрашивать пользователя ввести пароль и 
выводить True если пароль верный и False если нет.
"""


